import css from "./About.module.css";
import Container from "../../share/Container/Container";

const About = () => {
  return (
    <section className={css.section}>
      <Container>
        <h2 className={css.title}>
          Про проєкт <span className={css.titleSpan}>Vision</span>
        </h2>
        <div className={css.aboutWrapper}>
          <p>
            Команда Vision працює над проектом, який спрямований на розробку і
            впровадження нової системи, яка дозволить пілоту керувати FPV дроном
            з високою точністю та стабільністю на значній відстані. Використання
            FPV (відео з першої особи) дронів у комерційних, розважальних та
            безпілотних дослідницьких галузях зростає з кожним днем. Однак,
            складність досягнення цілі або попадання в точку на значній відстані
            стає суттєвим викликом для пілотів.
          </p>
        </div>
        <div className={css.goalsWrapper}>
          <h3 className={css.goalsTitle}>Цілі проєкту</h3>
          <ul className={css.goalsList}>
            <li className={css.goalsItem}>
              <div className={css.itemWrapper}>
                <p>
                  <span className={css.itemTitle}>Збільшення точності:</span>{" "}
                  наша головна мета - створити революційну систему, яка
                  дозволить пілотам керувати FPV дронами з високою точністю. Ми
                  працюємо над розробкою передових алгоритмів керування за
                  допомогою AI/ML та датчиків, що забезпечать максимально точне
                  позиціонування та маневреність дрона.
                </p>
              </div>
            </li>
            <li className={css.goalsItem}>
              <div className={css.itemWrapper}>
                <p>
                  <span className={css.itemTitle}>
                    Забезпечення стабільності:
                  </span>{" "}
                  ми розуміємо, що відсутність стабільності відеолінку при
                  зниженні дрона на відстані менше ніж 30-40 метрів може значно
                  ускладнити його керування. Наша команда працює над
                  вдосконаленням технології передачі даних, забезпечуючи
                  стабільний зв'язок навіть на низькій висоті.
                </p>
              </div>
            </li>
            <li className={css.goalsItem}>
              <div className={css.itemWrapper}>
                <p>
                  <span className={css.itemTitle}>
                    Оптимізація безпеки та ефективності для FPV дронів:
                  </span>{" "}
                  ми прагнемо розробити систему, яка зробить керування дроном
                  більш безпечним і ефективним. Це включає розробку вбудованих
                  функцій безпеки, автоматичних режимів польоту та інтерфейсу,
                  що дозволить пілотам легко взаємодіяти з дроном.
                </p>
              </div>
            </li>
            <li className={css.goalsItem}>
              <div className={css.itemWrapper}>
                <p>
                  <span className={css.itemTitle}>
                    Покращення користувацького досвіду:
                  </span>{" "}
                  ми прагнемо зробити FPV дрони доступнішими та зручнішими для
                  використання. Розробляючи інтуїтивно зрозуміле програмне
                  забезпечення та ергономічне управління, ми створимо дружній і
                  простий у використанні інтерфейс для пілотів будь-якого рівня
                  майстерності.
                </p>
              </div>
            </li>
          </ul>
        </div>
      </Container>
    </section>
  );
};

export default About;
